Tekla Open API Reference for Tekla Structures 2025
SpiralBeamDataException Constructor
 Initializes a new instance of the SpiralBeamDataException class with spiral beam error message based on status.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SpiralBeamDataException(
	SpiralBeam.ErrorStatus status,
	string message
)
Public Sub New (
	status As SpiralBeam.ErrorStatus,
	message As String
)
Parameters
status
Type: Tekla.Structures.Model.SpiralBeam.ErrorStatus
message
Type: System.String
See Also
Reference
SpiralBeamDataException Class
Tekla.Structures.Model Namespace